esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS.h
        stcMDNS_RRDomain(void);
        stcMDNS_RRDomain(const stcMDNS_RRDomain& p_Other);
        
        stcMDNS_RRDomain& operator=(const stcMDNS_RRDomain& p_Other);
        
        bool clear(void);
        
        bool addLabel(const char* p_pcLabel,
                      bool p_bPrependUnderline = false);
        
        bool compare(const stcMDNS_RRDomain& p_Other) const;
        bool operator==(const stcMDNS_RRDomain& p_Other) const;
        bool operator!=(const stcMDNS_RRDomain& p_Other) const;
        bool operator>(const stcMDNS_RRDomain& p_Other) const;
        
        size_t c_strLength(void) const;
        bool c_str(char* p_pcBuffer);
    };
    
    /**
     * stcMDNS_RRAttributes
     */
    struct stcMDNS_RRAttributes {
        uint16_t            m_u16Type;      // Type
        uint16_t            m_u16Class;     // Class, nearly always 'IN'
        
        stcMDNS_RRAttributes(uint16_t p_u16Type = 0,
                              uint16_t p_u16Class = 1 /*DNS_RRCLASS_IN Internet*/);
        stcMDNS_RRAttributes(const stcMDNS_RRAttributes& p_Other);
        
        stcMDNS_RRAttributes& operator=(const stcMDNS_RRAttributes& p_Other);
    };
    
    /**
     * stcMDNS_RRHeader
     */
    struct stcMDNS_RRHeader {
        stcMDNS_RRDomain        m_Domain;
        stcMDNS_RRAttributes    m_Attributes;
        
        stcMDNS_RRHeader(void);
        stcMDNS_RRHeader(const stcMDNS_RRHeader& p_Other);
        
        stcMDNS_RRHeader& operator=(const stcMDNS_RRHeader& p_Other);

        bool clear(void);
    };
    
    /**
     * stcMDNS_RRQuestion
     */
    struct stcMDNS_RRQuestion {
        stcMDNS_RRQuestion*     m_pNext;
        stcMDNS_RRHeader        m_Header;
        bool                    m_bUnicast;     // Unicast reply requested
        
        stcMDNS_RRQuestion(void);
    };
    
    /**
     * enuAnswerType
     */
    typedef enum _enuAnswerType {
        AnswerType_A,
        AnswerType_PTR,
        AnswerType_TXT,
        AnswerType_AAAA,
        AnswerType_SRV,
        AnswerType_Generic
    } enuAnswerType;
    
    /**
     * stcMDNS_RRAnswer
     */
    struct stcMDNS_RRAnswer {
        stcMDNS_RRAnswer*   m_pNext;
        const enuAnswerType m_AnswerType;
        stcMDNS_RRHeader    m_Header;
        bool                m_bCacheFlush;  // Cache flush command bit
        uint32_t            m_u32TTL;       // Validity time in seconds
        
        virtual ~stcMDNS_RRAnswer(void);
        
        enuAnswerType answerType(void) const;
        
        bool clear(void);
        
    protected:
        stcMDNS_RRAnswer(enuAnswerType p_AnswerType,
                          const stcMDNS_RRHeader& p_Header,
                          uint32_t p_u32TTL);
    };
    
#ifdef MDNS_IP4_SUPPORT
    /**
     * stcMDNS_RRAnswerA
     */
    struct stcMDNS_RRAnswerA : public stcMDNS_RRAnswer {
        IPAddress           m_IPAddress;
        
        stcMDNS_RRAnswerA(const stcMDNS_RRHeader& p_Header,
                           uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerA(void);
        
        bool clear(void);
    };
#endif

    /**
     * stcMDNS_RRAnswerPTR
     */
    struct stcMDNS_RRAnswerPTR : public stcMDNS_RRAnswer {
        stcMDNS_RRDomain    m_PTRDomain;
        
        stcMDNS_RRAnswerPTR(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerPTR(void);
        
        bool clear(void);
    };
    
    /**
     * stcMDNS_RRAnswerTXT
     */
    struct stcMDNS_RRAnswerTXT : public stcMDNS_RRAnswer {
        stcMDNSServiceTxts  m_Txts;
        
        stcMDNS_RRAnswerTXT(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerTXT(void);
        
        bool clear(void);
    };
    
#ifdef MDNS_IP6_SUPPORT
    /**
     * stcMDNS_RRAnswerAAAA
     */
    struct stcMDNS_RRAnswerAAAA : public stcMDNS_RRAnswer {
        //TODO: IP6Address          m_IPAddress;
        
        stcMDNS_RRAnswerAAAA(const stcMDNS_RRHeader& p_Header,
                              uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerAAAA(void);
        
        bool clear(void);
    };
#endif

    /**
     * stcMDNS_RRAnswerSRV
     */
    struct stcMDNS_RRAnswerSRV : public stcMDNS_RRAnswer {
        uint16_t            m_u16Priority;
        uint16_t            m_u16Weight;
        uint16_t            m_u16Port;
        stcMDNS_RRDomain    m_SRVDomain;
        
        stcMDNS_RRAnswerSRV(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerSRV(void);
        
        bool clear(void);
    };
    
    /**
     * stcMDNS_RRAnswerGeneric
     */
    struct stcMDNS_RRAnswerGeneric : public stcMDNS_RRAnswer {
        uint16_t            m_u16RDLength;  // Length of variable answer
        uint8_t*            m_pu8RDData;    // Offset of start of variable answer in packet
        
        stcMDNS_RRAnswerGeneric(const stcMDNS_RRHeader& p_Header,
                                 uint32_t p_u32TTL);
        ~stcMDNS_RRAnswerGeneric(void);
        
        bool clear(void);
    };


    /**
     * enuProbingStatus
     */
    typedef enum _enuProbingStatus {
        ProbingStatus_WaitingForData,
        ProbingStatus_ReadyToStart,
        ProbingStatus_InProgress,
        ProbingStatus_Done
    } enuProbingStatus;

    /**
     * stcProbeInformation
     */
    struct stcProbeInformation {
        enuProbingStatus                m_ProbingStatus;
        uint8_t                         m_u8SentCount;  // Used for probes and announcements
        esp8266::polledTimeout::oneShot m_Timeout;      // Used for probes and announcements
        //clsMDNSTimeFlag                 m_TimeFlag;     // Used for probes and announcements
        bool                            m_bConflict;
        bool                            m_bTiebreakNeeded;
        MDNSHostProbeResultCallbackFn   m_fnHostProbeResultCallback;
        MDNSServiceProbeResultCallbackFn m_fnServiceProbeResultCallback;

        stcProbeInformation(void);

